package KI305.Levkulych.Lab3;

/**
 * Інтерфейс {@code Tuner} визначає контракт для пристроїв, що мають
 * функціонал телевізійного тюнера.
 * <p>
 * Будь-який клас, що реалізує цей інтерфейс, зобов'язаний надати
 * реалізацію методів для сканування каналів та отримання інформації про стан
 * тюнера.
 * Це дозволяє працювати з різними типами тюнерів через єдиний стандартизований
 * API.
 *
 * @author Levkulych
 * @version 3.0
 * @since 2025
 */
public interface Tuner {
    /**
     * Виконує процес сканування доступних телевізійних каналів.
     * <p>
     * Логіка цього методу може включати пошук цифрових (DVB-T2/S2) або аналогових
     * сигналів
     * та збереження списку знайдених каналів у стані об'єкта.
     */
    void scanChannels();

    /**
     * Повертає рядок з детальною інформацією про поточний стан тюнера.
     * <p>
     * Інформація може включати модель тюнера, поточний канал, кількість знайдених
     * каналів тощо.
     *
     * @return Рядок, що містить статус тюнера.
     */
    String getTunerStatus();
}